# Homework

## Problem 4

### Import the libraries

#### Import արեք pandas գրադարանը pd  անունով

In [7]:
import pandas as pd

### Import the dataset baby_names.txt, assign it to a variable called baby_names

### Import արեք baby_names.txt dataset-ը ու այն վերագրեք baby_names փոփոխականի

In [8]:
baby_names = pd.read_csv('data/baby_names.csv')

### See the first 10 entries.

### Տպեք առաջին 10 արժեքը

In [9]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Delete the columns 'Unnamed: 0' and 'Id'

### Ջնջեք 'Unnamed: 0' ու 'Id' սյուները

In [10]:
baby_names.drop(['Unnamed: 0','Id'],axis = 1,inplace=True)

### Are there more male or female names in the dataset?

### Արդյոք dataset-ում ավելի շատ են կանացի թե տղամարդու անունները?

In [11]:
baby_names['Gender'].value_counts()

F    2404
M      99
Name: Gender, dtype: int64

### Delete the column 'Year'. Group the dataset by name and assign to names.

### Ջնջեք 'Year' սյունը. Խմբավորեք dataset-ը ըստ անունի ու վերագրեք արդյունքը names փոփոխականին

In [12]:
names = baby_names.drop(['Year'],axis = 1).groupby('Name')

### How many different names exist in the dataset?

### Քանի հատ տարբեր անուն կա dataset-ում?

In [13]:
len(baby_names['Name'].value_counts()) #indz tvum a aveli lav dzev ka sra hamar?
# kam el baby_names['Name'].nunique()

575

### What is the name with most occurrences?

### Որն է ամենաշատ հանդիպող անունը?

In [59]:
baby_names['Name'].value_counts().nlargest(1)

Riley    12
Name: Name, dtype: int64

### What is the median name occurrence?

### Որն է անունների հանդիպման մեդիանը՞

In [21]:
baby_names.groupby('Name')['Count']#harcy lav chem haskanum :(

### Get a summary with the mean, min, max, std and quartiles.

### Ստացեք dataset-ի ամփոփում mean, min, max, std ու quartile-ներով

In [70]:
baby_names.agg(['mean','min','max','std','quantile'])

,Unnamed: 0,Id,Name,Year,Gender,State,Count
mean,13008.300839,13009.300839,NaN,2008.895326,NaN,NaN,11.485018
min,11349.000000,11350.000000,Aaliyah,2004.000000,F,AK,5.000000
max,24174.000000,24175.000000,Zoey,2014.000000,M,AK,65.000000
std,2356.700693,2356.700693,NaN,3.252164,NaN,NaN,8.830294
quantile,12600.000000,12601.000000,NaN,2009.000000,NaN,NaN,8.000000